Revit 2024 API
SpatialElementGeometryCalculator Constructor (Document)
 Constructs a new calculator with default options for the geometry of spatial elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SpatialElementGeometryCalculator(
	Document aDoc
)
Visual Basic
Public Sub New ( _
	aDoc As Document _
)
Visual C++
public:
SpatialElementGeometryCalculator(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 The document that contains the spatial elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpatialElementGeometryCalculator Class
SpatialElementGeometryCalculator Overload
Autodesk.Revit.DB Namespace